app/controllers/admin/images_controller.rb

SELECT `images`.* FROM `images` ORDER BY id DESC LIMIT 15 OFFSET 0
---
  def index
    @images = Image.order("id DESC")
    @images = @images.search(:name_or_tag_taggings_tag_name_contains => params[:q]) if params[:q].present?
    @images = @images.page(params[:page]).per_page(params[:total].try(:to_i) || 40)

SELECT `images`.* FROM `images` WHERE `images`.`id` = 2 LIMIT 1
---
  def find_image
    @image = Image.find(params[:id])