app/controllers/admin/posts_controller.rb

  def update
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1