app/controllers/admin/sessions_controller.rb

SELECT `admins`.* FROM `admins` WHERE `admins`.`username` = 'admin' LIMIT 1
---
  def create
    admin = Admin.find_by_username(params[:username])