app/views/posts/show.html.haml

          = render "commentform"
          - @post.comments.each do |comment|
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1