app/controllers/comments_controller.rb

INSERT INTO `comments` (`admin_id`, `body`, `created_at`, `email`, `name`, `post_id`, `updated_at`, `user_id`, `user_type`) VALUES (NULL, 'test', '2012-10-27 19:52:38', 'dennistel90@gmail.com', 'dennis', 1, '2012-10-27 19:52:38', NULL, NULL)
---
  def create
    @comment = Comment.new(params[:comment])
    @comment.user = current_user
    current_post.comments << @comment