app/controllers/password_resets_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'dennistel90@gmail.com' LIMIT 1
---
  def create
    @user = User.find_by_email(params[:email])