app/controllers/posts_controller.rb

INSERT INTO `posts` (`admin_id`, `body`, `created_at`, `description`, `published_at`, `title`, `updated_at`, `user_id`) VALUES (NULL, NULL, '2012-10-29 09:38:19', '<p>\r\n	&nbsp;</p>\r\n<div>\r\n	Cras justo odio, dapibus ac facilisis in, egestas eget quam. Cum sociis natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus. Donec ullamcorper nulla non metus auctor fringilla. Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Cum sociis natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus. Nulla vitae elit libero, a pharetra augue. Aenean lacinia bibendum nulla sed consectetur.</div>\r\n<div>\r\n	&nbsp;</div>\r\n<div>\r\n	Maecenas faucibus mollis interdum. Curabitur blandit tempus porttitor. Nullam quis risus eget urna mollis ornare vel eu leo. Nulla vitae elit libero, a pharetra augue. Nulla vitae elit libero, a pharetra augue. Nullam quis risus eget urna mollis ornare vel eu leo.</div>\r\n<div>\r\n	&nbsp;</div>\r\n<div>\r\n	Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Cum sociis natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus. Curabitur blandit tempus porttitor. Nullam id dolor id nibh ultricies vehicula ut id elit. Donec ullamcorper nulla non metus auctor fringilla. Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Cras mattis consectetur purus sit amet fermentum.</div>\r\n', '2012-10-29 10:38:00', 'reward test', '2012-10-29 09:38:19', 10)
---
  def create
    @post = Post.new(params[:post])
    @post.user = current_user
    if @post.save