app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`activation_state`, `activation_token`, `activation_token_expires_at`, `active`, `created_at`, `crypted_password`, `email`, `optin`, `remember_me_token`, `remember_me_token_expires_at`, `reset_password_email_sent_at`, `reset_password_token`, `reset_password_token_expires_at`, `salt`, `show_skype`, `skypename`, `updated_at`, `username`) VALUES ('pending', 'JP3SDqRMFtKtJSACEpcz', NULL, 1, '2012-10-28 14:59:47', '$2a$10$wWv47/7WBfox/j9SFb.mluIl/qPmqA384QCuMyjg7J5vOtwEHWxTK', 'hoebejeroen@gmail.com', NULL, NULL, NULL, NULL, NULL, NULL, 'cTfxF8EmdtU1txqKykzH', NULL, NULL, '2012-10-28 14:59:47', 'jeroen')